from aiogram_dialog import DialogManager, ChatEvent
from aiogram_dialog.widgets.kbd import ManagedCheckboxAdapter, Multiselect
from aiogram_dialog.widgets.text import Const

check_lists = {'Чек лист1.0': ['Включити кіпер той що в залі 7,8,9 стіл',
                                'Перерахувати джойстики та записати в групу',
                                'Підключити джойстики до приставок',
                                'Включити телевізори (підключити megogo)',
                                'Поставити на зарядку термінал та годиники',
                                'Подоставляти стільці до 4,9,13 столів',
                                'Перевірити чи не хитаються столи',
                                'Пообрізати нитки диванів знизу',
                                'Попротирати дивани від цегли',
                                'Включити світильник Гло',
                                'Перевірити наявність всього необхідного в стейшинах',
                                'За 15 хв до початку зміни переодягнутись',
                                'Накрутити рукавички',
                                'Через годину поміняти джойстики на зарядці'],
                'Чек лист2.0': ['Включити кіпер на 1.0',
                                'Відкрити зміну адміна',
                                'Відкрити касову зміну',
                                'Відкрити власну зміну',
                                'Включити кіпер на 2.0',
                                'Відкрити касову зміну на 2.0',
                                'Взяти робочий телефон на 2.0',
                                'Перерахувати джойстики та записати в групу',
                                'Підключити джойстики до приставок',
                                'Включити телевізори (підключити megogo)',
                                'Поставити на зарядку годиники та термінал',
                                'Включити світильник Гло',
                                'Включити витяжки',
                                'Перевірити наявність всього необхідного в стейшинах',
                                'За 15 хв до початку зміни переодягнутись',
                                'Накрутити рукавички',
                                'Через годину поміняти джойстик на зарядці'],
                'Літній майданчик 1.0': ['Замітаємо весь літній майданчик .',
                                         'Протираємо всі столики та стейшен.',
                                         'Витираємо від бруду ніжки столів.',
                                         'Виносимо подушки (в цьому тобі допомагають працівники які вийшли на 2.0)',
                                         'На кожен столик розставляємо серветниці вони пронумеровані знизу.',
                                         'Включити розетки на 2.0 і на 1.0',
                                         'Одну корзинку з усім необхідним залишаємо на 2.0 '
                                         'іншу ставимо на стейнш той що на літньому майданчику',
                                         'Виносимо два стільці один біля хеш1.0, другий біля хеш 2.0.',
                                         'За 15 хв до початку зміни переодягнутись'],
                'Літній майданчик 2.0': ['Замітаємо весь літній майданчик .',
                                         'Протираємо всі столики та стейшен.',
                                         'Витираємо від бруду ніжки столів.',
                                         'Виносимо подушки (в цьому тобі допомагають працівники які вийшли на 2.0)',
                                         'На кожен столик розставляємо серветниці вони пронумеровані знизу.',
                                         'Включити розетки на 2.0 і на 1.0',
                                         'Одну корзинку з усім необхідним залишаємо на 2.0 іншу ставимо'
                                         ' на стейнш той що на літньому майданчику',
                                         'Виносимо два стільці один біля хеш1.0, другий біля хеш 2.0.',
                                         'За 15 хв до початку зміни переодягнутись']}


async def check_changed(event: ChatEvent, checkbox: ManagedCheckboxAdapter, manager: DialogManager):
    print("Check status changed:", checkbox.is_checked())

for key in check_lists:
    for checkbox in check_lists[key]:
        Multiselect(
            f'✅ {checkbox}',
            f'❌ {checkbox}',
            id=checkbox + '_' + key,